Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: For example, when the freshness parameter is the PDCP count, updating, by the source base station, the context of the terminal in the source base station includes: updating, by the source base station, a value of the PDCP count in the context of the terminal to a value of the PDCP count in the notification message if the value of the PDCP count in the notification message is greater than the value of the PDCP count in the context of the terminal in the source base station; or is understood as updating the value of the PDCP count in the context of the terminal to a value of the PDCP count indicated by the indication parameter.
de_de: Wenn der Aktualitätsparameter beispielsweise der PDCP-Zählung ist, umfasst das Aktualisieren des Kontexts des Endgeräts in der Quellbasisstation durch die Quellbasisstation: Aktualisieren eines Werts der PDCP-Zählung im Kontext des Endgeräts durch die Quellbasisstation auf einen Wert der PDCP-Zählung in der Benachrichtigungsnachricht, wenn der Wert der PDCP-Zählung in der Benachrichtigungsnachricht größer als der Wert der PDCP-Zählung im Kontext des Endgeräts in der Quellbasisstation ist; oder es versteht sich, dass der Wert der PDCP-Zählung im Kontext des Endgeräts auf einen Wert der PDCP-Zählung aktualisiert wird, der durch den Anzeigeparameter angezeigt wird.

source: For another example, when the freshness parameter is the quantity of rejection times, updating, by the source base station, the context of the terminal in the source base station based on the freshness parameter includes: increasing, by the source base station, the quantity of rejection times by 1.
de_de: Wenn der Aktualitätsparameter beispielsweise die Anzahl von Ablehnungszeiten ist, umfasst das Aktualisieren des Kontexts des Endgeräts in der Quellbasisstation durch die Quellbasisstation basierend auf dem Aktualitätsparameter: Erhöhen der Anzahl von Ablehnungszeiten durch die Quellbasisstation um 1.

source: [0206] In another implementation, alternatively, the source base station may first determine whether the value of the PDCP count in the notification message is greater than the value of the PDCP count in the context of the terminal in the source base station, if the value of the PDCP count in the notification message is greater than the value of the PDCP count in the context of the terminal in the source base station, the source base station checks the message authentication code, and if checking the message authentication code to be successful, the source base station updates the freshness parameter in the context of the terminal based on the freshness parameter.
de_de: [0206] In einer anderen Implementierung kann die Quellbasisstation alternativ zuerst bestimmen, ob der Wert der PDCP-Zählung in der Benachrichtigungsnachricht größer als der Wert der PDCP-Zählung im Kontext des Endgeräts in der Quellbasisstation ist, wenn der Wert der PDCP-Zählung in der Benachrichtigungsnachricht größer als der Wert der PDCP-Zählung im Kontext des Endgeräts in der Quellbasisstation ist, prüft die Quellbasisstation den Nachrichtenauthentifizierungscode, und wenn geprüft wird, dass der Nachrichtenauthentifizierungscode erfolgreich ist, aktualisiert die Quellbasisstation den Aktualitätsparameter im Kontext des Endgeräts basierend auf dem Aktualitätsparameter.

source: A specific update method is as follows: The source base station updates the value of the PDCP count in the context of the terminal to the value of the PDCP count in the notification message.
de_de: Ein spezifisches Aktualisierungsverfahren lautet wie folgt: Die Quellbasisstation aktualisiert den Wert der PDCP-Zählung im Kontext des Endgeräts auf den Wert der PDCP-Zählung in der Benachrichtigungsnachricht.

source: [0207] Step 406: The source base station sends a response message to the target base station, and the target base station receives the response message from the source base station.
de_de: [0207] Schritt 406: Die Quellbasisstation sendet eine Antwortnachricht an die Zielbasisstation, und die Zielbasisstation empfängt die Antwortnachricht von der Quellbasisstation.

source: [0208] Step 406 is an optional step.
de_de: [0208] Schritt 406 ist ein optionaler Schritt.

source: The response message is used by the source base station to notify the target base station after update of the context of the terminal is completed.
de_de: Die Antwortnachricht wird von der Quellbasisstation verwendet, um die Zielbasisstation zu benachrichtigen, nachdem die Aktualisierung des Kontexts des Endgeräts abgeschlossen ist.

source: [0209] Step 407: The target base station sends a connection resume rejection message to the terminal, and the terminal receives the connection resume rejection message from the target base station.
de_de: [0209] Schritt 407: Die Zielbasisstation sendet eine Verbindungswiederaufnahmeablehnungsnachricht an das Endgerät, und das Endgerät empfängt die Verbindungswiederaufnahmeablehnungsnachricht von der Zielbasisstation.

source: [0210] Step 407 is the same as step 304.
de_de: [0210] Schritt 407 ist der gleiche wie Schritt 304.

source: For details, refer to the foregoing description.
de_de: Für Details sei auf die vorstehende Beschreibung hingewiesen.

source: [0211] When the freshness parameter is the quantity of rejection times, after receiving the connection resume rejection message, the terminal updates the quantity of rejection times, including increasing the quantity of rejection times by 1.
de_de: [0211] Wenn der Aktualitätsparameter die Anzahl von Ablehnungszeiten ist, aktualisiert das Endgerät nach dem Empfangen der Verbindungsfortsetzungsablehnungsnachricht die Anzahl von Ablehnungszeiten, einschließlich des Erhöhens der Anzahl von Ablehnungszeiten um 1.

source: [0212] It should be noted that there is no limitation on a sequence between step 407 and step 404 to step 406, to be specific, step 407 may be performed before step 404, or may be performed after step 406, or may be performed between step 404 and step 406.
de_de: [0212] Es ist zu beachten, dass es keine Beschränkung auf eine Sequenz zwischen Schritt 407 und Schritt 404 bis Schritt 406 gibt, insbesondere kann Schritt 407 vor Schritt 404 durchgeführt werden oder kann nach Schritt 406 durchgeführt werden oder kann zwischen Schritt 404 und Schritt 406 durchgeführt werden.

source: [0213] According to step 404 to step 407, when the target base station determines to reject the connection resume request of the terminal, in one aspect, the target base station notifies the terminal that the connection resume request is rejected, and in another aspect, the target base station further instructs the source base station to update the context of the terminal, and specifically, update the freshness parameter stored in the source base station, so that freshness parameter consistency is maintained between the terminal and the source base station.
de_de: [0213] Gemäß Schritt 404 bis Schritt 407, wenn die Zielbasisstation bestimmt, die Verbindungswiederaufnahmeanforderung des Endgeräts abzulehnen, benachrichtigt die Zielbasisstation das Endgerät bei einem Aspekt, dass die Verbindungswiederaufnahmeanforderung abgelehnt wird, und bei einem weiteren Aspekt weist die Zielbasisstation ferner die Quellbasisstation an, den Kontext des Endgeräts zu aktualisieren und insbesondere den in der Quellbasisstation gespeicherten Aktualitätsparameter zu aktualisieren, so dass die Aktualitätsparameterkonsistenz zwischen dem Endgerät und der Quellbasisstation aufrechterhalten wird.

source: [0214] Step 408: The target base station sends a context request message to the source base station, and the source base station receives the context request message from the target base station.
de_de: [0214] Schritt 408: Die Zielbasisstation sendet eine Kontextanforderungsnachricht an die Quellbasisstation, und die Quellbasisstation empfängt die Kontextanforderungsnachricht von der Zielbasisstation.

source: [0215] The context request message includes the message authentication code generated by the terminal and the resume identifier, and the context request message is used to request to obtain the context of the terminal. Optionally, the context request message further includes the indication parameter.
de_de: [0215] Die Kontextanforderungsnachricht enthält den durch das Endgerät erzeugten Nachrichtenauthentifizierungscode und die Wiederaufnahmekennung, und die Kontextanforderungsnachricht wird verwendet, um anzufordern, den Kontext des Endgeräts zu erhalten. Optional enthält die Kontextanforderungsnachricht ferner den Anzeigeparameter.

source: [0216] Step 409: The source base station updates the freshness parameter in the context of the terminal if checking the message authentication code to be successful.
de_de: [0216] Schritt 409: Die Quellbasisstation aktualisiert den Aktualitätsparameter im Kontext des Endgeräts, wenn der Nachrichtenauthentifizierungscode als erfolgreich geprüft wird.

source: [0217] For a manner in which the source base station checks the message authentication code and a manner in which the source base station updates the freshness parameter in the context of the terminal, refer to the description in step 405.
de_de: [0217] Für eineWeise, in der die Quellbasisstation den Nachrichtenauthentifizierungscode prüft, und eine Weise, in der die Quellbasisstation den Aktualitätsparameter im Kontext des Endgeräts aktualisiert, wird auf die Beschreibung in Schritt 405 verwiesen.

source: [0218] Step 410: The source base station sends a context response message to the target base station, and the target base station receives the context response message from the source base station.
de_de: [0218] Schritt 410: Die Quellbasisstation sendet eine Kontextantwortnachricht an die Zielbasisstation, und die Zielbasisstation empfängt die Kontextantwortnachricht von der Quellbasisstation.

source: [0219] Step 411: The target base station sends a connection resume response message to the terminal, and the terminal receives the connection resume response message from the target base station.
de_de: [0219] Schritt 411: Die Zielbasisstation sendet eine Verbindungswiederaufnahmeantwortnachricht an das Endgerät, und das Endgerät empfängt die Verbindungswiederaufnahmeantwortnachricht von der Zielbasisstation.

source: [0220] Step 410 and step 411 are the same as step 307 and step 308.
de_de: [0220] Schritt 410 und Schritt 411 sind dieselben wie Schritt 307 und Schritt 308.

source: [0221] According to step 408 to step 411, when the target base station determines to accept the resuming of the connection to the terminal, the source base station checks the message authentication code of the terminal based on the freshness parameter.
de_de: [0221] Gemäß Schritt 408 bis Schritt 411, wenn die Zielbasisstation bestimmt, das Wiederaufnehmen der Verbindung mit dem Endgerät zu akzeptieren, prüft die Quellbasisstation den Nachrichtenauthentifizierungscode des Endgeräts basierend auf dem Aktualitätsparameter.

source: When the check is successful, in one aspect, the source base station updates the freshness parameter in the context of the terminal in the source base station, and in another aspect, the source base station sends an obtained context of the terminal to the target base station.
de_de: Wenn die Prüfung erfolgreich ist, aktualisiert die Quellbasisstation bei einem Aspekt den Aktualitätsparameter im Kontext des Endgeräts in der Quellbasisstation, und bei einem weiteren Aspekt sendet die Quellbasisstation einen erhaltenen Kontext des Endgeräts an die Zielbasisstation.

source: [0222] According to the method in step 401 to step 411, the freshness parameter is introduced into an input parameter used by the terminal to generate the message authentication code.
de_de: [0222] Gemäß dem Verfahren in Schritt 401 bis Schritt 411 wird der Aktualitätsparameter in einen Eingabeparameter eingeführt, der von dem Endgerät verwendet wird, um den Nachrichtenauthentifizierungscode zu erzeugen.

source: Correspondingly, the freshness parameter is also introduced into an input parameter used by the source base station to check the message authentication code.
de_de: Entsprechend wird der Aktualitätsparameter auch in einen Eingabeparameter eingeführt, der von der Quellbasisstation verwendet wird, um den Nachrichtenauthentifizierungscode zu prüfen.

source: In one aspect, if the target base station rejects the connection resume request of the terminal, the target base station may instruct the source base station to update the freshness parameter in the context of the terminal in step 404, so that freshness parameter consistency is maintained between the terminal and the source base station.
de_de: Bei einem Aspekt, wenn die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts ablehnt, kann die Zielbasisstation die Quellbasisstation anweisen, den Aktualitätsparameter im Kontext des Endgeräts in Schritt 404 zu aktualisieren, so dass die Aktualitätsparameterkonsistenz zwischen dem Endgerät und der Quellbasisstation aufrechterhalten wird.

source: In another aspect, if the target base station accepts the connection resume request of the terminal, the target base station may request to obtain the context of the terminal from the source base station in step 408, and the source base station may further update the freshness parameter in the context of the terminal in the source base station in this process, so that freshness parameter consistency is maintained between the terminal and the source base station.
de_de: Bei einem weiteren Aspekt, wenn die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts akzeptiert, kann die Zielbasisstation anfordern, den Kontext des Endgeräts von der Quellbasisstation in Schritt 408 zu erhalten, und die Quellbasisstation kann den Aktualitätsparameter im Kontext des Endgeräts in der Quellbasisstation in diesem Prozess weiter aktualisieren, so dass die Aktualitätsparameterkonsistenz zwischen dem Endgerät und der Quellbasisstation aufrechterhalten wird.

source: [0223] The foregoing solution 1 can effectively resolve the problem of being vulnerable to an attack when the manner 1 is used to generate the message authentication code in step 301.
de_de: [0223] Die vorstehende Lösung 1 kann das Problem, anfällig für einen Angriff zu sein, effektiv lösen, wenn die Weise 1 verwendet wird, um den Nachrichtenauthentifizierungscode in Schritt 301 zu erzeugen.

source: The following provides a description with reference to a specific example.
de_de: Im Folgenden wird eine Beschreibung unter Bezugnahme auf ein spezifisches Beispiel bereitgestellt.

source: [0224] Using an example in which a freshness parameter is a PDCP count, it is assumed that values of the PDCP counts currently stored in the terminal and the source base station are both 5, and the terminal is currently in an inactive state.
de_de: [0224] Unter Verwendung eines Beispiels, in dem ein Aktualitätsparameter eine PDCP-Zählung ist, wird angenommen, dass Werte der PDCP-Zählungen, die derzeit in dem Endgerät und der Quellbasisstation gespeichert sind, beide 5 sind, und das Endgerät befindet sich derzeit in einem inaktiven Zustand.

source: [0225] The terminal sends a connection resume request message to a target base station for the first time, where the connection resume request message carries a message authentication code, an indication parameter, and a resume identifier, the message authentication code is generated based on a PDCP count and an integrity protection key that is of the terminal, and the PDCP count indicated by the indication parameter is greater than 5, for example, is 10.
de_de: [0225] Das Endgerät sendet zum ersten Mal eine Verbindungswiederaufnahmeanforderungsnachricht an eine Zielbasisstation, wobei die Verbindungswiederaufnahmeanforderungsnachricht einen Nachrichtenauthentifizierungscode, einen Anzeigeparameter und eine Wiederaufnahmekennung trägt, der Nachrichtenauthentifizierungscode basierend auf einer PDCP-Zählung und einem Integritätsschutzschlüssel, der von dem Endgerät ist, erzeugt wird und die PDCP-Zählung, die durch den Anzeigeparameter angezeigt wird, größer als 5 ist, zum Beispiel 10 ist.

source: [0226] If the target base station rejects the connection resume request of the terminal, a connection resume rejection message sent to the terminal carries information about a wait timer, to instruct the terminal to attempt to re-initiate a connection resume request 30 minutes later.
de_de: [0226] Wenn die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts ablehnt, trägt eine an das Endgerät gesendete Verbindungswiederaufnahmeablehnungsnachricht Informationen über einen Wartezeitgeber, um das Endgerät anzuweisen, zu versuchen, 30 Minuten später eine Verbindungswiederaufnahmeanforderung neu zu initiieren.

source: In addition, the target base station instructs the source base station to update the PDCP count in the context of the terminal in the source base station to 10.
de_de: Darüber hinaus weist die Zielbasisstation die Quellbasisstation an, die PDCP-Zählung im Kontext des Endgeräts in der Quellbasisstation auf 10 zu aktualisieren.

source: [0227] It is assumed that before the terminal sends the connection resume request message to the target base station for the second time, an attacker steals the message authentication code and the resume identifier from the connection resume request message sent by the terminal to the target base station for the first time, where the PDCP count used to generate the message authentication code is 10.
de_de: [0227] Es wird angenommen, dass, bevor das Endgerät die Verbindungswiederaufnahmeanforderungsnachricht zum zweiten Mal an die Zielbasisstation sendet, ein Angreifer den Nachrichtenauthentifizierungscode und die Wiederaufnahmekennung aus der Verbindungswiederaufnahmeanforderungsnachricht, die vom Endgerät zum ersten Mal an die Zielbasisstation gesendet wurde, stehlen wird, wobei die PDCP-Zählung, die zum Erzeugen des Nachrichtenauthentifizierungscodes verwendet wird, 10 beträgt.

source: [0228] Then, the attacker sends the connection resume request message to the target base station, where the connection resume request message carries the stolen message authentication code and resume identifier.
de_de: [0228] Dann sendet der Angreifer die Verbindungswiederaufnahmeanforderungsnachricht an die Zielbasisstation, wobei die Verbindungswiederaufnahmeanforderungsnachricht den gestohlenen Nachrichtenauthentifizierungscode und die gestohlene Wiederaufnahmekennung trägt.

source: After receiving the connection resume request message, the target base station sends a context request message to the source base station if the target base station accepts the resume request of the attacker.
de_de: Nach dem Empfangen der Verbindungswiederaufnahmeanforderungsnachricht sendet die Zielbasisstation eine Kontextanforderungsnachricht an die Quellbasisstation, wenn die Zielbasisstation die Wiederaufnahmeanforderung des Angreifers akzeptiert.

source: Then, the source base station checks the message authentication code sent by the attacker.
de_de: Daraufhin überprüft die Quellbasisstation den von dem Angreifer gesendeten Nachrichtenauthentifizierungscode.

source: Because the PDCP count used when the message authentication code sent by the attacker is generated is 10, and the PDCP count in the context of the terminal in the source base station is also 10, the two are equal. Therefore, the check is failed.
de_de: Da der PDCP-Zählerstand, der verwendet wird, wenn der von dem Angreifer gesendete Nachrichtenauthentifizierungscode erzeugt wird, 10 ist, und der PDCP-Zählerstand im Kontext des Endgeräts in der Quellbasisstation ebenfalls 10 ist, sind beide gleich, daher ist die Überprüfung fehlgeschlagen.

source: Therefore, the attack performed by the attacker fails.
de_de: Daher schlägt der von dem Angreifer ausgeführte Angriff fehl.

source: [0229] Using an example in which the freshness parameter is the quantity of rejection times, it is assumed that values of the quantity of rejection times currently stored in the terminal and the source base station are both 2, and the terminal is currently in an inactive state.
de_de: [0229] Unter Verwendung eines Beispiels, in dem der Aktualitätsparameter die Anzahl von Ablehnungszeiten ist, wird angenommen, dass Werte der Anzahl von Ablehnungszeiten, die derzeit in dem Endgerät und der Quellbasisstation gespeichert sind, beide 2 sind, und das Endgerät befindet sich derzeit in einem inaktiven Zustand.

source: [0230] The terminal sends a connection resume request message to the target base station for the first time, where the connection resume request message carries a message authentication code and a resume identifier.
de_de: [0230] Das Endgerät sendet zum ersten Mal eine Verbindungswiederaufnahmeanforderungsnachricht an die Zielbasisstation, wobei die Verbindungswiederaufnahmeanforderungsnachricht einen Nachrichtenauthentifizierungscode und eine Wiederaufnahmekennung führt.

source: The message authentication code is generated based on a quantity of rejection times and an integrity protection key that is of the terminal, and in this case, the quantity of rejection times is 2.
de_de: Der Nachrichtenauthentifizierungscode wird basierend auf einer Anzahl von Ablehnungszeiten und einem Integritätsschutzschlüssel, der von dem Endgerät stammt, erzeugt, und in diesem Fall beträgt die Anzahl von Ablehnungszeiten 2.

source: [0231] If the target base station rejects the connection resume request of the terminal, a connection resume rejection message sent to the terminal carries information about a wait timer, to instruct the terminal to attempt to re-initiate a connection resume request 30 minutes later.
de_de: [0231] Wenn die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts ablehnt, führt eine an das Endgerät gesendete Verbindungswiederaufnahmeablehnungsnachricht Informationen über einen Wartezeitgeber, um das Endgerät anzuweisen, 30 Minuten später zu versuchen, eine Verbindungswiederaufnahmeanforderung neu zu initiieren.

source: In this case, the terminal updates the quantity of rejection times to 3. In addition, the target base station instructs the source base station to update the quantity of rejection times in the context of the terminal in the source base station to 3.
de_de: In diesem Fall aktualisiert das Endgerät die Anzahl von Ablehnungszeiten auf 3. Zusätzlich weist die Zielbasisstation die Quellbasisstation an, die Anzahl von Ablehnungszeiten im Kontext des Endgeräts in der Quellbasisstation auf 3 zu aktualisieren.

source: [0232] It is assumed that before the terminal sends the connection resume request message to the target base station for the second time, an attacker steals the message authentication code and the resume identifier from the connection resume request message sent by the terminal to the target base station for the first time, where the quantity of rejection times used to generate the message authentication code is 2.
de_de: [0232] Es wird angenommen, dass, bevor das Endgerät die Verbindungswiederaufnahmeanforderungsnachricht zum zweiten Mal an die Zielbasisstation sendet, ein Angreifer den Nachrichtenauthentifizierungscode und die Wiederaufnahmekennung aus der Verbindungswiederaufnahmeanforderungsnachricht, die vom Endgerät zum ersten Mal an die Zielbasisstation gesendet wurde, stehlen kann, wobei die Anzahl von Ablehnungszeiten, die zum Erzeugen des Nachrichtenauthentifizierungscodes verwendet wird, 2 beträgt.
